Repository: knyghtmare/Forward_They_Cried
Catalog: translations/wesnoth-Forward/*.po
Languages: ar, de, ja, pl

source: Forward They Cried
ar: إلى الأمام!
de: ‚Vorwärts!‘ riefen sie.
ja: 鬨の声あげ進軍せよ
pl: Naprzód Krzyczeli

source: team_name^Wesnothians
ar: الوسنوثيين
de: Wesnothianer
ja: Wesnoth 人
pl: Wesnothians

source: Hongfen
ar: القائد هونغفان

source: Sessius
ar: القائد سيسيوس

source: enemies^Orcs
ar: الأورك
de: Orks
ja: オーク
pl: Orki

source: Find and defeat the enemy leader
ar: جد واهزم قائد الأعداء
de: Finde und besiege den feindlichen Anführer
ja: 敵のリーダーを探して倒す
pl: Znajdź i pokonaj lidera przeciwnika

source: Death of Hongfen
ar: موت هونغفان
de: Tod Hongfens
ja: Hongfen の死
pl: Śmierć Hongfen

source: Culwych
ar: كولويش

source: These orcish scum have been prowling on the North Side of the River for too long. Our main invasion force will move over at dawn to scour them away. It is up to you, Lieutenant, to secure the beachhead over night while I prepare my forces. It should be an easy enough job for our Wesnothian forces, against these scattered goblin curs.
ar: كانت هذه الحثالة الأوركية تتجول على الجانب الشمالي من النهر لفترة طويلة جدًا. ستتحرك قوة الغزو الرئيسية عند الفجر لتطردهم. الأمر متروك لك، أيها الملازم، لتأمين رأس الجسر طوال الليل بينما أقوم بإعداد قواتي. يجب أن تكون مهمة سهلة بما فيه الكفاية لقواتنا الويسنوثية، ضد هذا الغوبلن المتناثر
de: Dieser Orkabschaum schleicht schon viel zu lange am Nordufer des Flusses herum. Unsere Hauptstreitmacht wird im Morgengrauen den Fluss überqueren und sie verscheuchen. Ihre Aufgabe heute Nacht ist es, Leutnant, einen Brückenkopf zu etablieren, während ich meine Kräfte zusammenziehe. Diese unorganisierten Hundesöhne sollten einfache Gegner sein für die tapferen Kämpfer von Wesnoth.
ja: オークのクズどもは、長い間、川の北側をウロツイていたのだ。我々侵入部隊は、夜明けとともに移動してあいつらを一掃する。お前の肩にかかっているぞ、中尉。私が部隊を準備している間、夜を徹して橋頭堡を確保するんだ。
pl: Te orkowe szumowiny zbyt długo grasują po północnej stronie rzeki. Nasze główne siły ruszą o świcie, aby je wypędzić. Poruczniku, do ciebie należy zabezpieczenie przyczółka na noc, podczas gdy ja będę przygotowywał swoje siły. To powinno być dość łatwe zadanie dla naszych jednostek. To tylko rozproszona garstka goblinów.

source: I have no doubts that this mission will go easily enough for me and my men.
ar: لا شك عندي أن هذه المهمة ستكون سهلة جدا لي والرجال.
de: Ich habe keine Zweifel, dass meine Männer diese Mission mit Bravour erfüllen werden.
ja: この任務は私の部隊にすれば容易いことです、お任せください。
pl: Nie wątpię, że razem z moimi ludźmi łatwo rozprawimy się z tą misją.

source: What's this? He failed against a few goblin rabble? The Weldyn Military Academy seems to have lowered their standards. Now, my troops will have to do this grunt work.
ar: ماهذا؟ لقد هزم أمام فئة ضئيلة من الغوالي! يبدو أن أكاديمية ويسنوث العسكرية قد أصبحت مهزلة. الان، أصبح علي أن اقوم بهذه المهمة السخيفة بنفسي.
de: Was zur Hölle? Versagt gegen einen kleinen Koboldhaufen? Die Ausbildung an der Militärakademie von Weldyn scheint viel von ihrer einstigen Qualität eingebüßt zu haben. Jetzt müssen meine Truppen den Müll wegräumen.
ja: 何だこれは？彼はゴブリンの暴徒数人を相手に失敗したのか？ Weldyn 軍事アカデミーは、レベルを落としているようだな。全く、我が部隊は、つまらぬ仕事を任されたものだ。
pl: Co jest? Zawiódł przeciwko garstce goblinów? Wydaje się, że Akademia Wojskowa Weldyn obniżyła swoje standardy. Teraz moje wojska będą musiały się tym zająć.

source: We are taking casualties, Sir.
ar: نحن نخسر رجالا كثيرين، سيدي!
de: Wir erleiden Verluste, Generalfeldmarschall.
ja: 犠牲者が出ています、隊長。
pl: Są ofiary, Panie.

source: Understood. Continue with the assault.
ar: مفهوم. واصلوا الهجوم حاليا.
de: Verstanden. Setzen Sie den Angriff fort.
ja: 分かった。攻撃を続けろ。
pl: Zrozumiałem. Kontynuować natarcie.

source: I am only a simple healer, and I am ill-equipped to deal with these brutes. Please protect me!
ar: أنا مجرد معالج بسيط ولست مؤهلا لخوض حروب جدية. ارجو ان تقوم بتوفير الحماية لي بينما أقوم بعملي.
de: Hilfe! Ich bin nur ein einfacher Heiler, und ich bin nicht dafür ausgebildet, mich mit solchen brutalen Schlägern auseinanderzusetzen.
ja: 私はただの治療師ですよ、こんな野獣たちは治せやしません。どうか守ってください！
pl: Jestem tylko prostym uzdrowicielem i nie jestem przygotowany do radzenia sobie z tymi bestiami. Proszę, ochroń mnie!

source: I never should have joined this forsaken army.
ar: ما كان علي القبول بالانضمام لهذا الجيش التعيس.
de: Ich hätte niemals freiwillig dieser verdammten Armee beitreten sollen.
ja: こんな孤独な軍隊になんか、入るんじゃなかった。
pl: Nigdy nie powinienem był dołączyć do tej przeklętej armii.

source: Foolish boy, that healer was worth more than you.
ar: أيها الغبي المبتدئ، ذلك المعالج له قيمة اكبر منك انت بحد ذاتك.
de: Trottel, dieser Heiler war mehr wert als du selbst.
ja: なに馬鹿なことを言ってる、あの治療師の方がお前よりもよほど役に立った。
pl: Głupi chłopcze, ten uzdrowiciel był wart więcej niż ty.

source: Yes, Sir.
ar: حاضر، سيدي.
de: Ja, Herr Generalfeldmarschall.
ja: はい、隊長。
pl: Tak, Panie.

source: It is midnight, you should be making better progress than this.
ar: انه منتصف الليل. كان ينبغي أن يكون تقدمك اسرع من هذا بكثير.
de: Es ist Mitternacht. Ich hatte eigentlich größere Fortschritte erwartet.
ja: さあ、真夜中だ、これまでよりも捗るはずだ。
pl: Już północ, twoje postępy powinny być szybsze.

source: You have failed in your mission. Now, my troops have to complete this piddling task for you. You, on the other hand, will be relieved of duty and brought before a court martial.
ar: لقد فشلت في مهمتك. الان، على قواتي أن تنجز واجباتك انت. أما انت فستمثل أمام محكمة عسكرية جزاء تخاذلك.
de: Sie haben versagt, Leutnant. Nun müssen meine eigenen Truppen Ihren lächerlichen Auftrag vollenden. Ich enthebe Sie Ihres Kommandos. Bereiten Sie sich auf eine Kriegsgerichtsverhandlung vor.
ja: お前たちは作戦に失敗した。この部隊は、このつまらぬ任務を自分たちのために完遂せねばならんのだ。それと、我々は任を解かれて、軍法会議にかけられだろう。
pl: Zawiodłeś, nie zdołałeś wykonać swojej misji. Teraz moi żołnierze muszą wykonać za ciebie to błahe zadanie. Ty natomiast zostaniesz zwolniony z obowiązków i postawiony przed sądem wojskowym.

source: The orcs have been routed, Sir!
ar: لقد هزمنا الاورك يا سيدي.
de: Die Orks wurden vertrieben, Herr Generalfeldmarschall!
ja: オークどもは撤退しました、隊長！
pl: Orkowie zostali rozbici, Panie!

source: Well done, soldier. Rally your men and return to Weldyn for debriefing. My forces shall now mobilise to secure the northern side of the river.
ar: عمل ممتاز. اجمع الجنود وعد للعاصمة ويلدن كي تقدم تقريرك. قواتي الان ستتحرك بأمان نحو الشمال.
de: Gut gemacht, Soldat. Versammeln Sie ihre Männer und kehren Sie zurück nach Weldyn zur Nachbesprechung. Meine frischen Kräfte werden das Nordufer sichern.
ja: よくやった、兵士たちよ。全員集合して Weldyn へ戻り、報告をせよ。我が軍隊は、川の北岸側を確保するために動員せねばならない。
pl: Dobra robota, żołnierzu. Zbierz swoich ludzi i wróć do Weldyn na odprawę. Moje siły muszą teraz zmobilizować się, by zabezpieczyć północną stronę rzeki.

source: You are the leader of an advanced detachment that has been tasked with capturing a bridgehead while the main army prepares to attack. It should be a simple enough assignment. (Intermediate Level, 1 scenario.)
ar: انت قائد وحدة عسكرية خلف خط الحرب ومهمتك حماية جسر ارضي ليمر الجيش بأكثر أمن وهي مهمة سهلة للغاية. (مستور متوسط، سيناريو واحد)
de: Du bist der Anführer einer kleinen Armeeeinheit mit der Aufgabe, einen Brückenkopf über einen Fluss zu schaffen, während sich die Hauptstreitmacht auf die Überquerung vorbereitet. Sollte eine einfache Aufgabe sein. (Einstufung: Mittel, 1 Szenario)
ja: あなたは前線部隊のリーダーで、本隊が準備をしている間に、橋頭堡を確保する仕事を任されました。簡単な任務のはずです。 （中級レベル、1シナリオ）
pl: Jesteś dowódcą zaawansowanego oddziału, którego zadaniem jest zajęcie przyczółka, podczas gdy główna armia przygotowuje się do ataku. To powinno być dość proste zadanie. (Poziom średniozaawansowany, 1 scenariusz).

source: Commander
ar: قائد
de: Kommandant
ja: 司令官
pl: Dowódca

source: Challenging
ar: تحدي
de: Herausfordernd
ja: 挑戦的
pl: Trudne

source: The End
ar: النهاية
de: Ende
pl: Koniec

source: Original Scenario Design
ar: المصمم الاصلي
de: Original Szenario Design
ja: オリジナル シナリオ・デザイン
pl: Oryginalny projekt scenariusza

source: Latest Scenario Revision
ar: اخر مراجع للحملة
de: Letzte Überarbeitung
ja: 最新版シナリオ
pl: Najnowsza wersja scenariusza
